<template>
  <div class="d-flex align-items-center flex-column">
    <h2 class="mt-5 text-center">Добро пожаловать!</h2>
    <p class="mt-4 text-center">Проект выполнен специально для экзамена по предмету <b>Веб-разработка на стороне клиента</b></p>
    <p class="text-center">Выполнил <b>Шальнов Кирилл Михайлович</b> студент <b>группы 201-321</b></p>
    <h4 class="text-center">Технологии</h4>
    <div class="mt-2">
      <b-button href="https://nuxtjs.org" class="text-center w-100">Nuxt.js</b-button>
      <b-button href="https://bootstrap-vue.org" class="text-center w-100 mt-2">BootstrapVue</b-button>
    </div>
    <a class="link d-flex flex-row mt-4" href="">
      <svg width="50" height="30" viewBox="0 0 50 50" fill="none" xmlns="http://www.w3.org/2000/svg">
        <path class="link__logo" d="M25 4.16667C13.4896 4.16667 4.16666 13.4896 4.16666 25C4.1643 29.3735 5.53919 33.6367 8.09628 37.1847C10.6534 40.7328 14.2628 43.3856 18.4125 44.7667C19.4542 44.9479 19.8437 44.3229 19.8437 43.775C19.8437 43.2812 19.8167 41.6417 19.8167 39.8958C14.5833 40.8604 13.2292 38.6208 12.8125 37.4479C12.5771 36.8479 11.5625 35 10.6771 34.5042C9.94791 34.1146 8.90624 33.15 10.65 33.125C12.2917 33.0979 13.4625 34.6354 13.8542 35.2604C15.7292 38.4104 18.725 37.525 19.9208 36.9792C20.1042 35.625 20.65 34.7146 21.25 34.1938C16.6146 33.6729 11.7708 31.875 11.7708 23.9063C11.7708 21.6396 12.5771 19.7667 13.9062 18.3063C13.6979 17.7854 12.9687 15.65 14.1146 12.7854C14.1146 12.7854 15.8583 12.2396 19.8437 14.9229C21.5397 14.4522 23.292 14.2153 25.0521 14.2188C26.8229 14.2188 28.5937 14.4521 30.2604 14.9208C34.2437 12.2125 35.9896 12.7875 35.9896 12.7875C37.1354 15.6521 36.4062 17.7875 36.1979 18.3083C37.525 19.7667 38.3333 21.6146 38.3333 23.9063C38.3333 31.9021 33.4646 33.6729 28.8292 34.1938C29.5833 34.8438 30.2354 36.0938 30.2354 38.0479C30.2354 40.8333 30.2083 43.0729 30.2083 43.7771C30.2083 44.3229 30.6 44.9729 31.6417 44.7646C35.7771 43.3683 39.3707 40.7104 41.9165 37.1649C44.4623 33.6194 45.8321 29.3648 45.8333 25C45.8333 13.4896 36.5104 4.16667 25 4.16667Z"/>
      </svg>
      <p class="link__text m-0">cntrkilril</p>
    </a>
  </div>
</template>

<script>
export default {
  name: "index"
}
</script>

<style scoped>

.link {
  align-items: center;
  text-decoration: none;
  color: #7a7a7a;
  cursor: pointer;
  transition: 0.3s;
}
.link__logo {
  fill: #7a7a7a;
}

.link:hover .link__logo {
  transition: 0.3s;
  fill: #000000;
}

.link:hover .link__text {
  transition: 0.3s;
  color: #000000;
}
</style>
